//
//  main.c
//  02-走出迷宫游戏
//
//  Created by 罂粟 on 2017/7/3.
//  Copyright © 2017年 sunny. All rights reserved.
//

#include <stdio.h>
/*
 定义在函数外部变量,称为全局变量
 1: 它在整个程序还没有启动的时候就进行分配内存并初始化
 2: 它在所有函数中都是可见的
 */

/*
 游戏说明: 玩家通过键盘录入w,s,a,d控制小人向不同方向移动,其中w代表向上移动,s向下,a向左,d向右移动\
 当小人移动到出口位置,玩家胜利
 
 地图如下:
 
 ######
 #0#
 # ## #
 #  # #
 ##   #
 ######
 
 说明: # 代表墙,0代表小人, ' '代表路
 
 分析:
 1: 打印地图
 1.1: 保存地图
 1.2: 打印
 2: 让玩家移动小人
 2.1: 提示玩家如何如何移动小人
 2.2: 接收玩家的录入
 2.3: 根据玩家录入来移动小人
 3: 判断输赢
 
 */
//宏定义: 它是一种编译预处理指令
#define ROWS 10
#define COLS 8

//声明函数的.h文件
#include "manyFunctionStatement.h"

//1:   1.1 保存地图
//char map[ROWS][COLS] = {
//
//    {'#','#','#','#','#','#',' ','#'},
//    {'#','0','#',' ','#',' ',' ','#'},
//    {'#',' ','#','#',' ',' ','#','#'},
//    {'#',' ',' ','#',' ','#','#','#'},
//    {'#','#',' ',' ',' ',' ','#','#'},
//    {'#',' ','#',' ','#',' ',' ',' '},
//    {' ',' ',' ',' ','#','#','#','#'},
//    {'#','#',' ','#','#','#','#','#'},
//    {' ',' ',' ','#','#','#','#','#'},
//    {'#','#',' ','#','#','#','#','#'}
//
//};
char map[ROWS][COLS] = {
    
    "###### #",
    "#0# #  #",
    "# ##  ##",
    "#  # ###",
    "##    ##",
    "  # #   ",
    "#     ",
    "## #####",
    "   ##   ",
    "## #####"
};

//为了判断小人的移动,我们需要定义变量来表示 路
char street = ' ';
//小人的初始坐标
int currentX = 1;
int currentY = 1;
//根据不同方向来计算下一个要移动的位置
//假设下一个位置就是当前位置
int nextX = 1;
int nextY = 1;
//定义一个方向变量
char direction;

int main(int argc, const char * argv[]) {
    
    //打印地图(函数)
    PrintMap();
    
    while (1) {
        //  2.1 提示玩家录入移动小人
        printf("请移动小人,w表示向上,s表示向下,a表示向左,d表示向右\n");
        
        //  2.2 接收用户的录入
        //%c 前面加一个空格,来吃掉后面的回车
        scanf(" %c",&direction);
        
        //假设下一个位置就是当前位置
        nextX = currentX;
        nextY = currentY;
        //根据不同方向来计算下一个要移动的位置(函数)
        calcNextPosition(direction);
        
        //移动小人判断下一个位置是不是路(函数)
        moveToNextPosition();
        
        //移动后打印地图(函数)
        PrintMap();
        
        //判断胜负(函数)
        if (judgeIsWin()) {
            break;
        }
    }
    
    return 0;
}







